In [52]:
# Dependencies
from sqlalchemy import create_engine
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from config import username, password, database

In [53]:
# Creating engine
from sqlalchemy import create_engine
engine = create_engine(f'postgresql://{username}:{password}@localhost:5432/{database}')
connection = engine.connect()

In [54]:
# Viewing salaries table and saving in salaries variable
salaries = pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [55]:
# Viewing titles table and saving in titles variable.
titles = pd.read_sql("SELECT * FROM titles", connection)
titles.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [56]:
# Executing SQL Query to join tables that have required fields.
join = pd.read_sql("SELECT s.emp_no, e.last_name, e.first_name, e.sex, s.salary, title "
       "FROM employees as e "
       "INNER JOIN salaries as s "
       "ON e.emp_no = s.emp_no "
       "INNER JOIN titles as tt "        
       "ON e.emp_title_id = tt.title_id;", connection)
join.head()

   emp_no  last_name first_name sex  salary         title
0   10005   Maliniak    Kyoichi   M   78228         Staff
1   10010   Piveteau  Duangkaew   F   72488      Engineer
2   10011      Sluis       Mary   F   42365         Staff
3   10013     Terkki  Eberhardt   M   40000  Senior Staff
4   10017  Bouloucos  Cristinel   F   71380         Staff

In [58]:
# turning into a DataFrame
joined = pd.DataFrame(join)
joined.head()

   emp_no  last_name first_name sex  salary         title
0   10005   Maliniak    Kyoichi   M   78228         Staff
1   10010   Piveteau  Duangkaew   F   72488      Engineer
2   10011      Sluis       Mary   F   42365         Staff
3   10013     Terkki  Eberhardt   M   40000  Senior Staff
4   10017  Bouloucos  Cristinel   F   71380         Staff

In [59]:
# joined
grouped = joined.groupby("title").mean()
grouped

                           emp_no        salary
title
Assistant Engineer  252992.595373  48564.434447
Engineer            253654.345919  48535.336511
Manager             110780.833333  51531.041667
Senior Engineer     253038.749885  48506.799871
Senior Staff        254481.798969  58550.172704
Staff               253408.503604  58465.382850
Technique Leader    251811.432730  48582.896092

In [60]:
title_salary_df = grouped.drop(columns = "emp_no")
title_salary_df

                          salary
title
Assistant Engineer  48564.434447
Engineer            48535.336511
Manager             51531.041667
Senior Engineer     48506.799871
Senior Staff        58550.172704
Staff               58465.382850
Technique Leader    48582.896092